pages/sites.org
#+BEGIN_COMMENT
.. title: Sites
.. slug: sites
.. date: 2020-09-30 21:42:32 UTC+02:00
.. tags: 
.. category: 
.. link:  
.. description: 
.. type: text

#+END_COMMENT

* Optimization and Constraint Programming

- [[https://github.com/coin-or/pulp][Pulp]]
- [[http://www.pyomo.org/][Pyomoo]]
- [[https://developers.google.com/optimization][Or tools]]
- [[http://picat-lang.org/][Picat]]
- [[http://picat-lang.org/][Hakank]], Many examples and implementations
- [[https://github.com/eomahony/Numberjack][Numberjack]], but this is
  perhaps dead.

A search on =python constraint programming= yields also many useful
links to tutorials and documentaion.


* Miscelaneous

- [[https://www.av8n.com/how/htm/airfoils.html#sec-fluid][Why airplanes fly]] There are many `explanations' of why planes fly, and nearly all
  of them are false, or worse, not even wrong. A number of those are
  debunked on this site.
