cache/pages/sites.html
<div id="outline-container-orga8ffb2a" class="outline-2">
<h2 id="orga8ffb2a">Optimization and Constraint Programming</h2>
<div class="outline-text-2" id="text-orga8ffb2a">
<ul class="org-ul">
<li><a href="https://github.com/coin-or/pulp">Pulp</a></li>
<li><a href="http://www.pyomo.org/">Pyomoo</a></li>
<li><a href="https://developers.google.com/optimization">Or tools</a></li>
<li><a href="http://picat-lang.org/">Picat</a></li>
<li><a href="http://picat-lang.org/">Hakank</a>, Many examples and implementations</li>
<li><a href="https://github.com/eomahony/Numberjack">Numberjack</a>, but this is
perhaps dead.</li>
</ul>

<p>
A search on <code>python constraint programming</code> yields also many useful
links to tutorials and documentaion.
</p>
</div>
</div>


<div id="outline-container-orgbf3b45b" class="outline-2">
<h2 id="orgbf3b45b">Miscelaneous</h2>
<div class="outline-text-2" id="text-orgbf3b45b">
<ul class="org-ul">
<li><a href="https://www.av8n.com/how/htm/airfoils.html#sec-fluid">Why airplanes fly</a> There are many `explanations' of why planes fly, and nearly all
of them are false, or worse, not even wrong. A number of those are
debunked on this site.</li>
</ul>
</div>
</div>
